#+TITLE: Org Timeline Viewer from Agenda Export
* Import into pandas as dataframe
The macro ~org-batch-agenda-csv~ doesn't export the headers, so we must append that line to the front of the file. After several unsuccessful trials, we create a new file, write the headers and then append the previous export from emacs.

#+begin_src python :session org-timeline-viewer
with open('tmp_agenda_with_headers.csv', mode='wt', encoding='utf-8') as headerfile:
  headers = 'category,head,type,todo,tags,date,time,extra,priority-l,priority-n,agenda-day\n'
  headerfile.write(headers)
  with open('tmp_agenda.csv', mode='r', encoding='utf-8') as datafile:
    for line in datafile:
      headerfile.write(line)
#+end_src

#+RESULTS:


#+begin_src python :session org-timeline-viewer
import pandas as pd
timeline = pd.read_csv('tmp_agenda_with_headers.csv', parse_dates=(['date','agenda-day']),index_col=False)
#+end_src

#+RESULTS:

Limitation: Dates must comply with ISO 8601 format. Right now, we can't add any kind of intervals for times or dates. Pandas will complain and it won't work.

Org doesn't export end date by default, so we rename date as start_date, then add a day as save it as and end_date.

#+begin_src python :session org-timeline-viewer
timeline.set_index('head')
timeline.rename(columns={'head':'heading','category':'orgfile','date':'start_date'}, inplace=True)
timeline['end_date'] = timeline['start_date'] + pd.Timedelta(days=1)
# TODO debug info to remove once this is settled down
timeline.info()
timeline.head()
#+end_src

#+RESULTS:
:            orgfile                       heading            type  todo  tags start_date   time       extra  priority-l  priority-n agenda-day   end_date
: 0  timestamp-test1                   Closed task  past-scheduled  DONE  tag2 2022-03-19    NaN  Scheduled:         NaN        1099 2022-03-19 2022-03-20
: 1  timestamp-test1             Previous deadline        deadline   NaN  tag2 2022-03-20  23:59   Deadline:         NaN        1000 2022-03-20 2022-03-21
: 2  timestamp-test1                   Closed task       timestamp  DONE  tag2 2022-03-20  19:00         NaN         NaN        1000 2022-03-20 2022-03-21
: 3  timestamp-test1  Demo scheluded date with tag       scheduled  TODO  tag1 2022-03-22    NaN  Scheduled:         NaN        1099 2022-03-22 2022-03-23
: 4  timestamp-test1             Previous deadline        deadline   NaN  tag2 2022-03-20    NaN   2 d. ago:         NaN        1002 2022-03-22 2022-03-21

